Documents/СчетНаОплатуПокупателю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>СчетНаОплатуПокупателю</Name>
			<BasedOn>
				<xr:Item>Document.Заявка</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Comment>Документ-основание</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонечныйПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Эксперт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерМТПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Цена</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>Сумма НДС</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Comment>Всего</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заявка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопИнформацияПоУслуге</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Comment>Свойство</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonForms/ПодборЗаявокВОплату/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокЗаявка.Дата КАК Дата,
		|	ДокЗаявка.Ссылка КАК Заявка,
		|	// ДокЗаявка.СуммаДокумента - ЕСТЬNULL(ОплатаЗаявокОбороты.СуммаОборот, 0) КАК Остаток
		|	ЕСТЬNull(ВзаиморасчетыОстатки.СуммаОстаток,0) КАК Остаток
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.Заявка КАК ДокЗаявка
		|		// ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОплатаЗаявок.Обороты КАК ОплатаЗаявокОбороты
		|		// ПО (ОплатаЗаявокОбороты.Заявка = ДокЗаявка.Ссылка)
		|    ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Взаиморасчеты.Остатки КАК ВзаиморасчетыОстатки
		|    	ПО ДокЗаявка.Ссылка = ВзаиморасчетыОстатки.Заявка
		|ГДЕ
		|	НЕ ДокЗаявка.ПометкаУдаления
		|	И ДокЗаявка.Договор = &Договор
		|	// И ДокЗаявка.СуммаДокумента - ЕСТЬNULL(ОплатаЗаявокОбороты.СуммаОборот, 0) > 0   
		|	И ЕСТЬNull(ВзаиморасчетыОстатки.СуммаОстаток,0)  > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Дата КАК Дата,
		|	ВТ.Заявка КАК Заявка,
		|	ВТ.Остаток КАК Остаток,
		|	МАКСИМУМ(ДокСчет.Номер) КАК НомерСчета
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю КАК ДокСчет
		|		ПО ВТ.Заявка = ДокСчет.Основание
		|			И (НЕ ДокСчет.ПометкаУдаления)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.Дата,
		|	ВТ.Заявка,
		|	ВТ.Остаток
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ.Дата";
	
	Запрос.УстановитьПараметр("Договор", Параметры.Договор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрТЗ = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(СтрТЗ, Выборка);
	КонецЦикла;
	
	ТаблПодобранных = ПолучитьИзВременногоХранилища(Параметры.АдресПодобранных);
	
	Для Каждого СтрПод Из ТаблПодобранных Цикл
		СтрокиТЗ = ТЗ.НайтиСтроки(Новый Структура("Заявка", СтрПод.Заявка));
		Если СтрокиТЗ.Количество()>0 Тогда
			СтрокиТЗ[0].Сумма = СтрПод.Сумма; 
		КонецЕсли;
	КонецЦикла;
	НераспределеннаяСумма = Параметры.СуммаДокумента - ТЗ.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ТЗСуммаПриИзменении(Элемент)
	НераспределеннаяСумма = Параметры.СуммаДокумента - ТЗ.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура Автоподбор(Команда)

	Для Каждого СтрТЗ Из ТЗ Цикл
		Если СтрТЗ.Сумма = СтрТЗ.Остаток Тогда
			Продолжить;
		КонецЕсли;
		Доступно = СтрТЗ.Остаток - СтрТЗ.Сумма;
		Закрыть = Мин(Доступно, НераспределеннаяСумма);
		Если Закрыть > 0 Тогда
			СтрТЗ.Сумма = СтрТЗ.Сумма + Закрыть;
			НераспределеннаяСумма = НераспределеннаяСумма - Закрыть;
		КонецЕсли;
		Если НераспределеннаяСумма = 0 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицу()
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("Заявка", Новый ОписаниеТипов("ДокументСсылка.Заявка"));
	ТаблицаРезультат.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(12, 2, ДопустимыйЗнак.Любой)));
	Для Каждого Тек Из ТЗ Цикл
		Если Тек.Сумма > 0 Тогда
			НовТЗ = ТаблицаРезультат.Добавить();
			НовТЗ.Заявка = Тек.Заявка;
			НовТЗ.Сумма = Тек.Сумма;
		КонецЕсли;
	КонецЦикла;
	Если НераспределеннаяСумма > 0 Тогда
		НовТЗ = ТаблицаРезультат.Добавить();
		//НовТЗ.Заявка = Тек.Заявка;
		НовТЗ.Сумма = НераспределеннаяСумма;
	КонецЕсли;
	Возврат ПоместитьВоВременноеХранилище(ТаблицаРезультат);
	
КонецФункции

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(ПолучитьТаблицу());
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры
